redisTestResult/redisMutiThreadsTestResultFix/redis_test_result_by_memtier_benchmark_FM_OFF_2nd/redis_result_Random82_FM_OFF_P1_2nd_20230719201839.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         6187.77          ---          ---         3.24690         3.11900         6.33500         7.74300      6645.73 
Gets        24741.15     24741.15         0.00         3.22517         3.10300         6.30300         7.48700     26451.47 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      30928.92     24741.15         0.00         3.22952         3.10300         6.30300         7.55100     33097.20 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.351        0.000
SET       2.911        5.000
SET       2.959       10.000
SET       2.991       15.000
SET       3.007       20.000
SET       3.039       25.000
SET       3.055       30.000
SET       3.071       35.000
SET       3.087       40.000
SET       3.103       45.000
SET       3.119       50.000
SET       3.119       52.500
SET       3.135       55.000
SET       3.135       57.500
SET       3.151       60.000
SET       3.151       62.500
SET       3.167       65.000
SET       3.167       67.500
SET       3.183       70.000
SET       3.199       72.500
SET       3.215       75.000
SET       3.215       76.250
SET       3.231       77.500
SET       3.231       78.750
SET       3.247       80.000
SET       3.247       81.250
SET       3.263       82.500
SET       3.279       83.750
SET       3.295       85.000
SET       3.327       86.250
SET       3.359       87.500
SET       3.391       88.125
SET       3.407       88.750
SET       3.439       89.375
SET       3.487       90.000
SET       3.535       90.625
SET       3.583       91.250
SET       3.631       91.875
SET       3.695       92.500
SET       3.759       93.125
SET       3.839       93.750
SET       3.871       94.062
SET       3.935       94.375
SET       3.999       94.688
SET       4.127       95.000
SET       4.255       95.312
SET       4.383       95.625
SET       4.479       95.938
SET       4.607       96.250
SET       4.959       96.562
SET       5.791       96.875
SET       5.887       97.031
SET       5.983       97.188
SET       6.015       97.344
SET       6.047       97.500
SET       6.079       97.656
SET       6.111       97.812
SET       6.143       97.969
SET       6.175       98.125
SET       6.175       98.281
SET       6.207       98.438
SET       6.239       98.516
SET       6.239       98.594
SET       6.271       98.672
SET       6.271       98.750
SET       6.303       98.828
SET       6.303       98.906
SET       6.335       98.984
SET       6.335       99.062
SET       6.367       99.141
SET       6.399       99.219
SET       6.431       99.258
SET       6.431       99.297
SET       6.431       99.336
SET       6.463       99.375
SET       6.495       99.414
SET       6.495       99.453
SET       6.527       99.492
SET       6.559       99.531
SET       6.623       99.570
SET       6.687       99.609
SET       6.719       99.629
SET       6.783       99.648
SET       6.815       99.668
SET       6.879       99.688
SET       6.943       99.707
SET       6.975       99.727
SET       7.071       99.746
SET       7.135       99.766
SET       7.199       99.785
SET       7.263       99.805
SET       7.295       99.814
SET       7.327       99.824
SET       7.359       99.834
SET       7.423       99.844
SET       7.455       99.854
SET       7.519       99.863
SET       7.583       99.873
SET       7.615       99.883
SET       7.679       99.893
SET       7.775       99.902
SET       7.807       99.907
SET       7.839       99.912
SET       7.903       99.917
SET       7.967       99.922
SET       8.031       99.927
SET       8.063       99.932
SET       8.159       99.937
SET       8.319       99.941
SET       8.447       99.946
SET       8.575       99.951
SET       8.639       99.954
SET       8.639       99.956
SET       8.703       99.958
SET       8.767       99.961
SET       8.831       99.963
SET       8.831       99.966
SET       8.895       99.968
SET       8.895       99.971
SET       8.959       99.973
SET       9.023       99.976
SET       9.087       99.977
SET       9.087       99.978
SET       9.151       99.979
SET       9.279       99.980
SET       9.343       99.982
SET       9.407       99.983
SET       9.407       99.984
SET       9.535       99.985
SET       9.599       99.987
SET       9.983       99.988
SET      10.047       99.988
SET      10.047       99.989
SET      10.175       99.990
SET      10.175       99.990
SET      10.623       99.991
SET      10.623       99.991
SET      12.095       99.992
SET      12.543       99.993
SET      14.015       99.993
SET      14.015       99.994
SET      14.079       99.994
SET      14.079       99.995
SET      14.399       99.995
SET      14.399       99.995
SET      14.463       99.995
SET      15.103       99.996
SET      15.231       99.996
SET      15.231       99.996
SET      15.359       99.997
SET      15.359       99.997
SET      15.359       99.997
SET      15.871       99.997
SET      15.871       99.997
SET      15.871       99.998
SET      19.455       99.998
SET      19.455       99.998
SET      20.223       99.998
SET      20.223       99.998
SET      20.223       99.998
SET      20.351       99.998
SET      20.351       99.999
SET      20.351       99.999
SET      20.351       99.999
[...]
SET      20.607       99.999
SET      20.607       99.999
SET      20.607       99.999
[...]
SET      25.855       99.999
SET      25.855       99.999
SET      25.855       99.999
[...]
SET      25.855      100.000
SET      25.855      100.000
SET      25.855      100.000
SET      25.983      100.000
SET      25.983      100.000
---
GET       0.567        0.000
GET       2.895        5.000
GET       2.959       10.000
GET       2.975       15.000
GET       3.007       20.000
GET       3.023       25.000
GET       3.039       30.000
GET       3.055       35.000
GET       3.071       40.000
GET       3.087       45.000
GET       3.103       50.000
GET       3.119       52.500
GET       3.119       55.000
GET       3.135       57.500
GET       3.135       60.000
GET       3.151       62.500
GET       3.151       65.000
GET       3.167       67.500
GET       3.183       70.000
GET       3.183       72.500
GET       3.199       75.000
GET       3.215       76.250
GET       3.215       77.500
GET       3.231       78.750
GET       3.231       80.000
GET       3.247       81.250
GET       3.263       82.500
GET       3.263       83.750
GET       3.295       85.000
GET       3.311       86.250
GET       3.343       87.500
GET       3.359       88.125
GET       3.375       88.750
GET       3.407       89.375
GET       3.439       90.000
GET       3.487       90.625
GET       3.535       91.250
GET       3.583       91.875
GET       3.615       92.500
GET       3.679       93.125
GET       3.727       93.750
GET       3.759       94.062
GET       3.791       94.375
GET       3.839       94.688
GET       3.887       95.000
GET       3.935       95.312
GET       4.015       95.625
GET       4.159       95.938
GET       4.351       96.250
GET       4.511       96.562
GET       4.927       96.875
GET       5.599       97.031
GET       5.823       97.188
GET       5.919       97.344
GET       5.983       97.500
GET       6.015       97.656
GET       6.047       97.812
GET       6.079       97.969
GET       6.111       98.125
GET       6.143       98.281
GET       6.175       98.438
GET       6.207       98.516
GET       6.207       98.594
GET       6.239       98.672
GET       6.239       98.750
GET       6.271       98.828
GET       6.271       98.906
GET       6.303       98.984
GET       6.303       99.062
GET       6.335       99.141
GET       6.367       99.219
GET       6.367       99.258
GET       6.367       99.297
GET       6.399       99.336
GET       6.399       99.375
GET       6.431       99.414
GET       6.431       99.453
GET       6.463       99.492
GET       6.495       99.531
GET       6.527       99.570
GET       6.559       99.609
GET       6.559       99.629
GET       6.591       99.648
GET       6.623       99.668
GET       6.655       99.688
GET       6.687       99.707
GET       6.751       99.727
GET       6.815       99.746
GET       6.879       99.766
GET       6.975       99.785
GET       7.039       99.805
GET       7.103       99.814
GET       7.135       99.824
GET       7.167       99.834
GET       7.231       99.844
GET       7.263       99.854
GET       7.295       99.863
GET       7.327       99.873
GET       7.391       99.883
GET       7.423       99.893
GET       7.487       99.902
GET       7.519       99.907
GET       7.551       99.912
GET       7.615       99.917
GET       7.647       99.922
GET       7.679       99.927
GET       7.711       99.932
GET       7.775       99.937
GET       7.807       99.941
GET       7.871       99.946
GET       7.935       99.951
GET       7.967       99.954
GET       7.999       99.956
GET       8.063       99.958
GET       8.127       99.961
GET       8.255       99.963
GET       8.319       99.966
GET       8.447       99.968
GET       8.639       99.971
GET       8.703       99.973
GET       8.767       99.976
GET       8.831       99.977
GET       8.895       99.978
GET       8.895       99.979
GET       8.959       99.980
GET       9.023       99.982
GET       9.023       99.983
GET       9.087       99.984
GET       9.215       99.985
GET       9.279       99.987
GET       9.343       99.988
GET       9.407       99.988
GET       9.471       99.989
GET       9.535       99.990
GET       9.599       99.990
GET       9.791       99.991
GET       9.919       99.991
GET      10.111       99.992
GET      10.559       99.993
GET      11.071       99.993
GET      11.583       99.994
GET      12.671       99.994
GET      13.375       99.995
GET      13.439       99.995
GET      13.695       99.995
GET      13.951       99.995
GET      14.015       99.996
GET      14.271       99.996
GET      14.335       99.996
GET      14.527       99.997
GET      14.719       99.997
GET      15.103       99.997
GET      15.167       99.997
GET      15.359       99.997
GET      15.359       99.998
GET      15.487       99.998
GET      15.551       99.998
GET      16.895       99.998
GET      16.895       99.998
GET      17.023       99.998
GET      17.023       99.998
GET      17.663       99.999
GET      19.455       99.999
GET      19.583       99.999
GET      19.583       99.999
GET      19.711       99.999
GET      19.711       99.999
GET      20.351       99.999
GET      20.351       99.999
GET      20.479       99.999
GET      20.479       99.999
GET      20.479       99.999
[...]
GET      20.607       99.999
GET      20.607       99.999
GET      20.607      100.000
GET      20.607      100.000
GET      20.607      100.000
GET      20.863      100.000
GET      20.863      100.000
GET      20.863      100.000
[...]
GET      25.855      100.000
GET      25.855      100.000
GET      25.855      100.000
[...]
GET      25.983      100.000
GET      25.983      100.000
---
WAIT      0.000      100.000